TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_output_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG1SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG1SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG2SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG2SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG3SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG3SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG4SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG4SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG5SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG5SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG6SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG6SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARG7SEL register
//
//*************************************************************************************************
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT0    0x1U          // Select bit for INPUT0
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT1    0x2U          // Select bit for INPUT1
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT2    0x4U          // Select bit for INPUT2
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT3    0x8U          // Select bit for INPUT3
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT4    0x10U         // Select bit for INPUT4
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT5    0x20U         // Select bit for INPUT5
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT6    0x40U         // Select bit for INPUT6
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT7    0x80U         // Select bit for INPUT7
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT8    0x100U        // Select bit for INPUT8
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT9    0x200U        // Select bit for INPUT9
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT10   0x400U        // Select bit for INPUT10
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT11   0x800U        // Select bit for INPUT11
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define OUTPUT_XBAR_OUTPUTXBARG7SEL_INPUT31   0x80000000U   // Select bit for INPUT31

